In [3]:
import numpy as np 
import pandas as pd

**Finding Missing Data**

In [4]:
data = {
    'A': [1, 2, np.nan, 4, 5],
    'B': [1, 2, 3, 4, 5],
    'C': [1, 2, 3, np.nan, np.nan],
    'D': [1, np.nan, np.nan, np.nan, 5]
}
df = pd.DataFrame(data)

In [5]:
df

     A  B    C    D
0  1.0  1  1.0  1.0
1  2.0  2  2.0  NaN
2  NaN  3  3.0  NaN
3  4.0  4  NaN  NaN
4  5.0  5  NaN  5.0

In [6]:
pd.isna(df)

       A      B      C      D
0  False  False  False  False
1  False  False  False   True
2   True  False  False   True
3  False  False   True   True
4  False  False   True  False

In [7]:
pd.isna(df).sum()

A    1
B    0
C    2
D    3
dtype: int64

**Filling the missing Data**

In [10]:
#fill all with zero
df.fillna(0)

     A  B    C    D
0  1.0  1  1.0  1.0
1  2.0  2  2.0  0.0
2  0.0  3  3.0  0.0
3  4.0  4  0.0  0.0
4  5.0  5  0.0  5.0

In [12]:
df.fillna(df.mean())

     A  B    C    D
0  1.0  1  1.0  1.0
1  2.0  2  2.0  3.0
2  3.0  3  3.0  3.0
3  4.0  4  2.0  3.0
4  5.0  5  2.0  5.0

In [19]:
#put value for every column
val={'A':15,'B':25,'C':35,'D':45}
df.fillna(val)

      A  B     C     D
0   1.0  1   1.0   1.0
1   2.0  2   2.0  45.0
2  15.0  3   3.0  45.0
3   4.0  4  35.0  45.0
4   5.0  5  35.0   5.0

**Removing Missing Data**

In [14]:
df.dropna() # by default which row has no null value it only exist

     A  B    C    D
0  1.0  1  1.0  1.0

In [17]:
df.dropna(thresh=3) #  which row has at least 3 value it only show

     A  B    C    D
0  1.0  1  1.0  1.0
1  2.0  2  2.0  NaN
4  5.0  5  NaN  5.0